package crsWork;

public final class Names {
    private static String[] maleFirstNames = {"Андрей", "Анатолий", "Антон", "Артем", "Александр", "Алексей", "Борис",
            "Богдан", "Владимир", "Владислав", "Василий", "Виктор", "Валерий", "Генадий", "Глеб", "Георгий", "Дмитрий",
            "Даниил", "Денис", "Евгений", "Егор", "Зураб", "Игорь", "Игнат", "Иван", "Илон", "Иполит", "Клим", "Леонид", "Лев",
            "Михаил", "Матвей", "Марк", "Николай", "Нурлан", "Олег", "Павел", "Пётр", "Роман", "Ринат", "Руслан", "Фёдор",
            "Сергей", "Семён", "Станислав", "Святослав", "Тимофей", "Тимур", "Ян", "Ярослав"};

    private static String[] maleMiddleNames = {"Андреевич", "Анатольевич", "Антонович", "Артемович", "Александрович",
            "Алексеевич", "Борисович", "Богданович", "Владимирович", "Владиславович", "Васильевич", "Викторович",
            "Валерьевич", "Генадьевич", "Глебович", "Георгович", "Дмитриевич", "Денисович", "Евгеньевич", "Егорович",
            "Зурабович", "Игоревич", "Игнатович", "Иванович", "Иполитович", "Леонидович", "Львович", "Михайлович",
            "Маркович", "Николеевич", "Олегович", "Павлович", "Пётрович", "Романович", "Ринатович", "Русланович",
            "Фёдорович", "Сергеевич", "Семёнович", "Станиславович", "Святославович", "Тимофеевич", "Тимурович", "Ярославович"};
    private static String[] maleLastNames = {"Иванов", "Петров", "Сидоров", "Пушкин", "Медведев", "Достаевский",
            "Толстой", "Мелешников", "Семенов", "Андреев", "Смирнов", "Кузнецов", "Попов", "Васильев", "Соколов",
            "Михайлов", "Новиков", "Федоров", "Морозов", "Волков", "Алексеев", "Лебедев", "Егоров", "Павлов", "Козлов",
            "Степанов", "Николаев", "Орлов", "Маск", "Макаров", "Никитин", "Зарахов", "Зайцев", "Соловьев", "Воротников",
            "Борисов", "Левашов", "Афонин" };

    private static String[] femaleFirstNames = {"Алиса", "Анна", "Алина", "Ариана", "Александра", "Арина", "Василиса",
            "Владлена", "Валентина", "Валерия", "Варвара", "Вера", "Галина", "Гульнара", "Диана", "Дарина", "Дарья",
            "Евгения", "Елена", "Ева", "Екатерина", "Елизавета", "Жанна", "Жасмин", "Зинаида", "Зоя", "Ирина", "Инна",
            "Инга", "Илона", "Кристина", "Ксения", "Клавдия", "Карина", "Людмила", "Любовь", "Лидия", "Лариса", "Мария",
            "Маргарита", "Мая", "Нина", "Наталья", "Надежда", "Ольга", "Полина", "Роза", "Раиса", "Светлана", "София",
            "Тамара", "Татьяна", "Ульяна", "Фатима", "Элла", "Эмма", "Юлия", "Яна"};

    private static String[] femaleMiddleNames = {"Андреевна", "Анатольевна", "Антоновна", "Александровна",
            "Алексеевна", "Борисовна", "Богдановна", "Владимировна", "Владиславовна", "Васильевна", "Викторовна",
            "Валерьевна", "Генадьевна", "Глебовна", "Георгиевна", "Дмитриевна", "Денисовна", "Евгеньевна", "Егоровна",
            "Зурабовна", "Игоревна", "Игнатьевна", "Ивановна", "Иполитовна", "Леонидовна", "Львовна", "Михайловна",
            "Марковна", "Николеевна", "Олеговна", "Павловна", "Пётровна", "Романовна", "Ринатовна", "Руслановна",
            "Фёдоровна", "Сергеевна", "Семёновна", "Станиславовна", "Святославовна", "Тимофеевна", "Тимуровна", "Ярославовна"};
    private static String[] femaleLastNames = {"Иванова", "Петрова", "Сидорова", "Пушкина", "Медведева", "Достаевская",
            "Мелешникова", "Семенова", "Андреева", "Смирнова", "Кузнецова", "Попова", "Васильева", "Соколова",
            "Михайлова", "Новикова", "Федорова", "Морозова", "Волкова", "Алексеева", "Лебедева", "Егорова", "Павлова",
            "Козлова", "Степанова", "Николаева", "Орлова", "Макарова", "Никитина", "Зарахова", "Зайцева", "Соловьева",
            "Воротникова", "Борисова", "Левашова", "Афонина" };

    public static String[] getMaleFirstNames() {
        return maleFirstNames;
    }

    public static String[] getMaleMiddleNames() {
        return maleMiddleNames;
    }

    public static String[] getMaleLastNames() {
        return maleLastNames;
    }

    public static String[] getFemaleFirstNames() {
        return femaleFirstNames;
    }

    public static String[] getFemaleMiddleNames() {
        return femaleMiddleNames;
    }

    public static String[] getFemaleLastNames() {
        return femaleLastNames;
    }
}
